import pandas as pd
import pytest


@pytest.fixture
def my_dataframe():
    df = pd.DataFrame(
        {
            "Дата платежа": ["2020-01-01", "2020-01-03", "2020-02-01", "2020-02-03"],
            "state": ["EXECUTED", "CANCELED", "EXECUTED", "CANCELED"],
        }
    )
    return df


@pytest.fixture
def my_category_list():
    return [
        "Супермаркеты",
        "Различные товары",
        "Переводы",
        "Каршеринг",
        "Пополнения",
        "Канцтовары",
        "Ж/д билеты",
        "Фастфуд",
        "Дом и ремонт",
        "Аптеки",
        "Связь",
        "Такси",
        "Транспорт",
        "Цветы",
        "Развлечения",
        "Госуслуги",
        "Местный транспорт",
        "Другое",
        "Бонусы",
        "Топливо",
        "Услуги банка",
        "Сервис",
        "ЖКХ",
        "Детские товары",
        "Косметика",
        "Одежда и обувь",
        "НКО",
        "Электроника и техника",
        "Наличные",
        "Сувениры",
        "Мобильная связь",
        "Медицина",
        "Фото и видео",
        "Онлайн-кинотеатры",
        "Авиабилеты",
        "Образование",
        "Рестораны",
        "Частные услуги",
        "Красота",
        "Турагентства",
        "Книги",
        "Отели",
        "Кино",
        "Спорттовары",
        "Автоуслуги",
        "Зарплата",
        "Финансы",
        "Искусство",
        "Duty Free",
    ]


TEST_STOCKS = ["AAPL", "GOOGL"]
TEST_RESPONSE_AAPL = {"symbol": "AAPL", "price": 150.0}
TEST_RESPONSE_GOOGL = {"symbol": "GOOGL", "price": 2800.0}
